fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВМК_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СуммаЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВМК_МассовоеСозданиеРеализаций/Module.bsl
#Область СлужебныеПРоцедурыИФункции
Функция ЕстьВДоговорВМассиве(Массив, Договор)
    Для Каждого Элемент Из Массив Цикл
        Если Элемент = Договор Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;
    Возврат Ложь;
КонецФункции

Функция СоздатьРеализации(Параметры) Экспорт

    Если НЕ ТипЗнч(Параметры) = Тип("Структура") Тогда
        ВызватьИсключение "Неверный тип параметров";
    КонецЕсли;

    ДатаНачала = Параметры.ДатаНачала;
    ДатаОкончания = Параметры.ДатаОкончания;

    Если НЕ (ТипЗнч(ДатаНачала) = Тип("Дата") И ТипЗнч(ДатаОкончания) = Тип("Дата")) Тогда
        ВызватьИсключение "Параметры должны содержать даты ДатаНачала и ДатаОкончания";
    КонецЕсли;

    Результат = Новый Структура;
    Результат.Вставить("ДокументовСоздано", 0);
    Результат.Вставить("ДокументовНеСоздано", 0);
    Результат.Вставить("МассивДоговоровИРеализаций", Новый Массив);

    // 1. Получим список договоров, по которым уже есть реализации
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
        |Реализация.Договор КАК Договор
        |ИЗ
        |Документ.РеализацияТоваровУслуг КАК Реализация
        |ГДЕ
        | Реализация.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

    МассивУжеСозданныхДоговоров = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        МассивУжеСозданныхДоговоров.Добавить(Выборка.Договор);
    КонецЦикла;

    // 2. Собираем подходящие договоры
    МассивДляСоздания = Новый Массив;
    Договоры = Справочники.ДоговорыКонтрагентов.Выбрать();
    Пока Договоры.Следующий() Цикл
        Если НЕ Договоры.ЭтоГруппа И
           Договоры.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И
           НЕ ЕстьВДоговорВМассиве(МассивУжеСозданныхДоговоров, Договоры.Ссылка) Тогда

            МассивДляСоздания.Добавить(Договоры.Ссылка);
        КонецЕсли;
    КонецЦикла;

    // Создаем документы
    Для Каждого Договор Из МассивДляСоздания Цикл
        Попытка
            ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            ДокументРеализация.Дата = ДатаОкончания;
            ДокументРеализация.Договор = Договор;
            ДокументРеализация.Контрагент = Договор.Владелец;
            ДокументРеализация.Организация = Договор.Организация;

            ДокументРеализация.ВМК_ВыполнитьАвтозаполнение();
            ДокументРеализация.СуммаДокумента = ДокументРеализация.Услуги.Итог("Сумма");

            //Если НЕ ДокументРеализация.ПроверитьЗаполнение() Тогда
                //Результат.ДокументовНеСоздано = Результат.ДокументовНеСоздано + 1;
               // Продолжить;
           // КонецЕсли;

            ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
           
СтрРеализация = Новый Структура;
СтрРеализация.Вставить("Договор", Договор);
СтрРеализация.Вставить("Реализация", ДокументРеализация.Ссылка);
Результат.МассивДоговоровИРеализаций.Добавить(СтрРеализация);

            Результат.ДокументовСоздано = Результат.ДокументовСоздано + 1;

        Исключение
            Результат.ДокументовНеСоздано = Результат.ДокументовНеСоздано + 1;
        КонецПопытки;
    КонецЦикла;

    РезультатХранилища = Новый Структура;
РезультатХранилища.Вставить("ДокументовСоздано", Результат.ДокументовСоздано);
РезультатХранилища.Вставить("ДокументовНеСоздано", Результат.ДокументовНеСоздано);
РезультатХранилища.Вставить("МассивДоговоровИРеализаций", Результат.МассивДоговоровИРеализаций);




Возврат РезультатХранилища;

КонецФункции
#КонецОбласти
